content/MUS-Departments.org
#+TITLE: Medical University of Sofia | Departments Information
#+OPTIONS: num:nil ^:{} date:nil timestamp:nil creator:t
#+export_file_name: ../public/MUS-Departments.html
#+DESCRIPTION: Information regarding the medical departments, of the Medical University of Sofia
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup



+ MUS-Documentation, information relative to the medical departments of the Medical University of Sofia
  + Contact information
  + Study resources
    
/for more information, check out my [[https://www.thanosapollo.com][homepage]]/

* 1st year
** Chemistry
kkamenova@medfac.mu-sofia.bg

sruseva@medfac.mu-sofia.bg

mchemistry@medfac.mu-sofia.bg

[[https://drive.google.com/drive/folders/1DRYDQZ8CIrEEq2fNHsLHhYz4_upde9iW\n\\][Google Drive]]
** Anatomy
[[https://www.facebook.com/dandovangel][facebook]]

blandzhov@medfac.mu-sofia.bg

tvkirov@gmail.com

adandov@medfac.mu-sofia.bg

anatomy@medfac.mu-sofia.bg

lmalinova@medfac.mu-Sofia.bg

s.stanchev@medfac.mu-sofia.bg

nikola.stamenov1@gmail.com

aailiev@medfac.mu-sofia.bg

jelev@abv.bgq

aivanov@medfac.mu-sofia.b
** Physics
[[https://drive.google.com/drive/folders/1pHafpj_yjvdpxS1PFMC4B-fR5yhyeBxc][Google Drive]]

[[https://www.facebook.com/todor.ganchev.9047][facebook]]

biophysics@medfac.mu-sofia.bg

tbogdanov@medfac.mu-sofia.bg
** Ethics
occdiseases@medfac.mu-sofia.bg
** Biology
[[https://drive.google.com/drive/folders/1dprI1xs3aOIDYshw3NtjGgUI32Jnz-3m][Google Drive]]

[[https://www.facebook.com/groups/mu.biology/][facebook]]

biology@medfac.mu-sofia.bg
** Latin
[[http://deos.mu-sofia.bg/remote-edu-lat/'][website]]
** Bulgarian language for foreign students
[[http://deos.mu-sofia.bg/remote-edu-bg/][Website]]

p.kuncheva@deos.mu-sofia.bg

s.todorova@deos.mu-sofia.bg

i.tomov@deos.mu-sofia.bg
* 2nd year
** Biophysics
[[https://drive.google.com/drive/folders/1pHafpj_yjvdpxS1PFMC4B-fR5yhyeBxc][Google Drive]]

[[https://www.facebook.com/todor.ganchev.9047][facebook]]

biophysics@medfac.mu-sofia.bg

syovchev@medfac.mu-sofia.bg

lltraikov@medfac.mu-sofia.bg

saleksandrov@medfac.mu-sofia.bg

** Biochemistry
[[https://drive.google.com/drive/folders/1DRYDQZ8CIrEEq2fNHsLHhYz4_upde9iW][Google Drive]]

biochem_exam@medfac.mu-sofia.bg

skvalkova@medfac.mu-sofia.bg

nishkitiev@medfac.mu-sofia.bg

** Physiology:
[[https://drive.google.com/drive/folders/1kPFF5S78C_05wzaWfF8OIXFJnCWbSJXp?usp=sharing][Google Drive]]

jnyagolov@medfac.mu-sofia.bg

rmpopova@medfac.mu-sofia.bg

psomlev@medfac.mu-sofia.bg

** Psychology:
mhristova@medfac.mu-sofia.bg

dignatova@mеdfac.mu-sofia.bg

[[https://drive.google.com/drive/folders/1TeuQMJUHd3I9_1mGm8R8mGGM59bj2btH][Google Drive]]

** MCS
d.todorova.dm@gmail.com

d.todorova@foz.mu-sofia.bg

medicineofdisasters@medfac.mu-sofia.bg

d.dimitrova@medfac.mu-sofia.bg

[[https://foz.mu-sofia.bg/?page_id=1409][website]]
** Social medicine:
socialmedicine@medfac.mu-sofia.bg
* 3rd year
** Clinical Immunology
[[https://drive.google.com/drive/folders/1D-rcIIzvSnsC3amJH-Fn0RJjmi6UXIUc][Google Drive year 3]]

[[https://drive.google.com/drive/folders/18TKdhBABWhL9eaXjkOEMO67FeYcWAZCN][Google Drive year 5]]

[[https://www.facebook.com/profile.php?id=100048911691308][facebook]]
** General Surgery
[[https://www.facebook.com/opsurgery][facebook]] 

opsurgery@medfac.mu-sofia.bg

opsurgery@medfac.mu-sofia.bg

yanislavmitkov@abv.bg
** Medical Genetics
[[https://drive.google.com/drive/folders/1WJJ6P60zXlDY7eiFd3UHQ4ZICzG0wgUd][Google Drive]]

[[https://www.facebook.com/profile.php?id=100048659782406][facebook]]

medgenetics@medfac.mu-sofia.bg

m.mihaylova@medfac.mu-sofia.bg

medgenetics@medfac.mu-sofia.bg

vdamyanova@medfac.mu-sofia.bg

rada.staneva@medfac.mu-sofia.bg
