public/MUS-Departments.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Medical University of Sofia | Departments Information</title>
<meta name="author" content="Thanos Apollo" />
<meta name="description" content="Information regarding the medical departments, of the Medical University of Sofia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Medical University of Sofia | Departments Information</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4c4b1bf">1st year</a>
<ul>
<li><a href="#orga2fc111">Chemistry</a></li>
<li><a href="#org5790b60">Anatomy</a></li>
<li><a href="#orgc2097c0">Physics</a></li>
<li><a href="#org4e4e2f2">Ethics</a></li>
<li><a href="#org056e146">Biology</a></li>
<li><a href="#orge5b6386">Latin</a></li>
<li><a href="#orgdc3dead">Bulgarian language for foreign students</a></li>
</ul>
</li>
<li><a href="#orgd868d7d">2nd year</a>
<ul>
<li><a href="#org71dded5">Biophysics</a></li>
<li><a href="#orgd3678d2">Biochemistry</a></li>
<li><a href="#org8692730">Physiology:</a></li>
<li><a href="#org994f2ec">Psychology:</a></li>
<li><a href="#org6240dd2">MCS</a></li>
<li><a href="#org8246e53">Social medicine:</a></li>
</ul>
</li>
<li><a href="#orgcdb9eb3">3rd year</a>
<ul>
<li><a href="#org8bf7bd3">Clinical Immunology</a></li>
<li><a href="#org4469d4f">General Surgery</a></li>
<li><a href="#org9fa5b43">Medical Genetics</a></li>
<li><a href="#orgf9ee42a">Pathology</a></li>
<li><a href="#org30eb5ae">Medical Microbiology</a></li>
<li><a href="#org0dfc09d">Pathophysiology</a></li>
<li><a href="#org8d0422f">Department of Pharmacology and Toxicology</a></li>
<li><a href="#org2d10038">Propedeutics of Internal Diseases</a></li>
</ul>
</li>
<li><a href="#org4d81fd5">4th year</a>
<ul>
<li><a href="#org0697599">Department Imaging</a></li>
<li><a href="#orga5681d9">Nuclear Medicine</a></li>
<li><a href="#org1213a39">Otorhinolaryngology</a></li>
<li><a href="#org444d4db">Department of Hygiene:</a></li>
<li><a href="#org4315ee4">Department of Occupational Diseases</a></li>
<li><a href="#orgdaa370b">Department of Ophthalmology</a></li>
<li><a href="#org98f431c">Neurology:</a></li>
<li><a href="#org734339a">Department of General and clinical pathology</a></li>
<li><a href="#org854bb9e">Gastroenterology</a></li>
<li><a href="#orgb274cbb">Pulmonary diseases</a></li>
<li><a href="#org3949f79">General Medicine</a></li>
<li><a href="#org1eb328d">Surgery</a></li>
<li><a href="#org9b14177">Cardiology</a></li>
<li><a href="#orgfe87eef">Nephrology</a></li>
<li><a href="#orgec54328">Department of Internal Medicine</a></li>
</ul>
</li>
<li><a href="#orgb5bcc44">5th year</a>
<ul>
<li><a href="#orgba7bfcc">Endocrinology</a></li>
<li><a href="#orga7b8f3e">Hematology</a></li>
<li><a href="#org63ff951">Rheumatology</a></li>
<li><a href="#org749317a">Allergiology</a></li>
<li><a href="#orge8cc7b3">Department of Clinical Laboratory</a></li>
<li><a href="#orga86a99d">Clinical Immunology</a></li>
<li><a href="#orgcde4b08">Clinical Pharmacology</a></li>
<li><a href="#org442ce3d">Obstetrics Gynecology</a></li>
<li><a href="#orgd3d70e8">Pediatrics</a></li>
<li><a href="#org026d65c">Neurosurgery:</a></li>
<li><a href="#orgb855597">Clinic Toxicology</a></li>
<li><a href="#org4740224">Dermatology and Venereology</a></li>
<li><a href="#orga2cb306">Orthopedics and Traumatology</a></li>
</ul>
</li>
<li><a href="#orgfd3bb19">6th year</a>
<ul>
<li><a href="#orge711fe9">Anesthesiology</a></li>
<li><a href="#orgcf1c6a4">Psychiatry</a></li>
<li><a href="#org831c1f5">Urology</a></li>
<li><a href="#org21fa54a">Physiotherapy</a></li>
<li><a href="#orgc6be2de">Department of Epidemiology</a></li>
<li><a href="#org8ec5966">Cardiovascular Surgery and Invasive Cardiology</a></li>
<li><a href="#org61edf67">0ccupational diseases:</a></li>
<li><a href="#org8d52fd9">Hygiene</a></li>
<li><a href="#orgc1cec36">Obstetrics Gynecology</a></li>
<li><a href="#orgdf5babb">Forensic Medicine</a></li>
</ul>
</li>
</ul>
</div>
</div>
<ul class="org-ul">
<li>MUS-Documentation, information relative to the medical departments of the Medical University of Sofia
<ul class="org-ul">
<li>Contact information</li>
<li>Study resources</li>
</ul></li>
</ul>

<p>
<i>for more information, check out my <a href="https://www.thanosapollo.com">homepage</a></i>
</p>

<div id="outline-container-org4c4b1bf" class="outline-2">
<h2 id="org4c4b1bf">1st year</h2>
<div class="outline-text-2" id="text-org4c4b1bf">
</div>
<div id="outline-container-orga2fc111" class="outline-3">
<h3 id="orga2fc111">Chemistry</h3>
<div class="outline-text-3" id="text-orga2fc111">
<p>
kkamenova@medfac.mu-sofia.bg
</p>

<p>
sruseva@medfac.mu-sofia.bg
</p>

<p>
mchemistry@medfac.mu-sofia.bg
</p>

<p>
<a href="https://drive.google.com/drive/folders/1DRYDQZ8CIrEEq2fNHsLHhYz4_upde9iW%5Cn%5C">Google Drive</a>
</p>
</div>
</div>
<div id="outline-container-org5790b60" class="outline-3">
<h3 id="org5790b60">Anatomy</h3>
<div class="outline-text-3" id="text-org5790b60">
<p>
<a href="https://www.facebook.com/dandovangel">facebook</a>
</p>

<p>
blandzhov@medfac.mu-sofia.bg
</p>

<p>
tvkirov@gmail.com
</p>

<p>
adandov@medfac.mu-sofia.bg
</p>

<p>
anatomy@medfac.mu-sofia.bg
</p>

<p>
lmalinova@medfac.mu-Sofia.bg
</p>

<p>
s.stanchev@medfac.mu-sofia.bg
</p>

<p>
nikola.stamenov1@gmail.com
</p>

<p>
aailiev@medfac.mu-sofia.bg
</p>

<p>
jelev@abv.bgq
</p>

<p>
aivanov@medfac.mu-sofia.b
</p>
</div>
</div>
<div id="outline-container-orgc2097c0" class="outline-3">
<h3 id="orgc2097c0">Physics</h3>
<div class="outline-text-3" id="text-orgc2097c0">
<p>
<a href="https://drive.google.com/drive/folders/1pHafpj_yjvdpxS1PFMC4B-fR5yhyeBxc">Google Drive</a>
</p>

<p>
<a href="https://www.facebook.com/todor.ganchev.9047">facebook</a>
</p>

<p>
biophysics@medfac.mu-sofia.bg
</p>

<p>
tbogdanov@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-org4e4e2f2" class="outline-3">
<h3 id="org4e4e2f2">Ethics</h3>
<div class="outline-text-3" id="text-org4e4e2f2">
<p>
occdiseases@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-org056e146" class="outline-3">
<h3 id="org056e146">Biology</h3>
<div class="outline-text-3" id="text-org056e146">
<p>
<a href="https://drive.google.com/drive/folders/1dprI1xs3aOIDYshw3NtjGgUI32Jnz-3m">Google Drive</a>
</p>

<p>
<a href="https://www.facebook.com/groups/mu.biology/">facebook</a>
</p>

<p>
biology@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-orge5b6386" class="outline-3">
<h3 id="orge5b6386">Latin</h3>
<div class="outline-text-3" id="text-orge5b6386">
<p>
<a href="http://deos.mu-sofia.bg/remote-edu-lat/'">website</a>
</p>
</div>
</div>
<div id="outline-container-orgdc3dead" class="outline-3">
<h3 id="orgdc3dead">Bulgarian language for foreign students</h3>
<div class="outline-text-3" id="text-orgdc3dead">
<p>
<a href="http://deos.mu-sofia.bg/remote-edu-bg/">Website</a>
</p>

<p>
p.kuncheva@deos.mu-sofia.bg
</p>

<p>
s.todorova@deos.mu-sofia.bg
</p>

<p>
i.tomov@deos.mu-sofia.bg
</p>
</div>
</div>
</div>
<div id="outline-container-orgd868d7d" class="outline-2">
<h2 id="orgd868d7d">2nd year</h2>
<div class="outline-text-2" id="text-orgd868d7d">
</div>
<div id="outline-container-org71dded5" class="outline-3">
<h3 id="org71dded5">Biophysics</h3>
<div class="outline-text-3" id="text-org71dded5">
<p>
<a href="https://drive.google.com/drive/folders/1pHafpj_yjvdpxS1PFMC4B-fR5yhyeBxc">Google Drive</a>
</p>

<p>
<a href="https://www.facebook.com/todor.ganchev.9047">facebook</a>
</p>

<p>
biophysics@medfac.mu-sofia.bg
</p>

<p>
syovchev@medfac.mu-sofia.bg
</p>

<p>
lltraikov@medfac.mu-sofia.bg
</p>

<p>
saleksandrov@medfac.mu-sofia.bg
</p>
</div>
</div>

<div id="outline-container-orgd3678d2" class="outline-3">
<h3 id="orgd3678d2">Biochemistry</h3>
<div class="outline-text-3" id="text-orgd3678d2">
<p>
<a href="https://drive.google.com/drive/folders/1DRYDQZ8CIrEEq2fNHsLHhYz4_upde9iW">Google Drive</a>
</p>

<p>
biochem_exam@medfac.mu-sofia.bg
</p>

<p>
skvalkova@medfac.mu-sofia.bg
</p>

<p>
nishkitiev@medfac.mu-sofia.bg
</p>
</div>
</div>

<div id="outline-container-org8692730" class="outline-3">
<h3 id="org8692730">Physiology:</h3>
<div class="outline-text-3" id="text-org8692730">
<p>
<a href="https://drive.google.com/drive/folders/1kPFF5S78C_05wzaWfF8OIXFJnCWbSJXp?usp=sharing">Google Drive</a>
</p>

<p>
jnyagolov@medfac.mu-sofia.bg
</p>

<p>
rmpopova@medfac.mu-sofia.bg
</p>

<p>
psomlev@medfac.mu-sofia.bg
</p>
</div>
</div>

<div id="outline-container-org994f2ec" class="outline-3">
<h3 id="org994f2ec">Psychology:</h3>
<div class="outline-text-3" id="text-org994f2ec">
<p>
mhristova@medfac.mu-sofia.bg
</p>

<p>
dignatova@mеdfac.mu-sofia.bg
</p>

<p>
<a href="https://drive.google.com/drive/folders/1TeuQMJUHd3I9_1mGm8R8mGGM59bj2btH">Google Drive</a>
</p>
</div>
</div>

<div id="outline-container-org6240dd2" class="outline-3">
<h3 id="org6240dd2">MCS</h3>
<div class="outline-text-3" id="text-org6240dd2">
<p>
d.todorova.dm@gmail.com
</p>

<p>
d.todorova@foz.mu-sofia.bg
</p>

<p>
medicineofdisasters@medfac.mu-sofia.bg
</p>

<p>
d.dimitrova@medfac.mu-sofia.bg
</p>

<p>
<a href="https://foz.mu-sofia.bg/?page_id=1409">website</a>
</p>
</div>
</div>
<div id="outline-container-org8246e53" class="outline-3">
<h3 id="org8246e53">Social medicine:</h3>
<div class="outline-text-3" id="text-org8246e53">
<p>
socialmedicine@medfac.mu-sofia.bg
</p>
</div>
</div>
</div>
<div id="outline-container-orgcdb9eb3" class="outline-2">
<h2 id="orgcdb9eb3">3rd year</h2>
<div class="outline-text-2" id="text-orgcdb9eb3">
</div>
<div id="outline-container-org8bf7bd3" class="outline-3">
<h3 id="org8bf7bd3">Clinical Immunology</h3>
<div class="outline-text-3" id="text-org8bf7bd3">
<p>
<a href="https://drive.google.com/drive/folders/1D-rcIIzvSnsC3amJH-Fn0RJjmi6UXIUc">Google Drive year 3</a>
</p>

<p>
<a href="https://drive.google.com/drive/folders/18TKdhBABWhL9eaXjkOEMO67FeYcWAZCN">Google Drive year 5</a>
</p>

<p>
<a href="https://www.facebook.com/profile.php?id=100048911691308">facebook</a>
</p>
</div>
</div>
<div id="outline-container-org4469d4f" class="outline-3">
<h3 id="org4469d4f">General Surgery</h3>
<div class="outline-text-3" id="text-org4469d4f">
<p>
<a href="https://www.facebook.com/opsurgery">facebook</a> 
</p>

<p>
opsurgery@medfac.mu-sofia.bg
</p>

<p>
opsurgery@medfac.mu-sofia.bg
</p>

<p>
yanislavmitkov@abv.bg
</p>
</div>
</div>
<div id="outline-container-org9fa5b43" class="outline-3">
<h3 id="org9fa5b43">Medical Genetics</h3>
<div class="outline-text-3" id="text-org9fa5b43">
<p>
<a href="https://drive.google.com/drive/folders/1WJJ6P60zXlDY7eiFd3UHQ4ZICzG0wgUd">Google Drive</a>
</p>

<p>
<a href="https://www.facebook.com/profile.php?id=100048659782406">facebook</a>
</p>

<p>
medgenetics@medfac.mu-sofia.bg
</p>

<p>
m.mihaylova@medfac.mu-sofia.bg
</p>

<p>
medgenetics@medfac.mu-sofia.bg
</p>

<p>
vdamyanova@medfac.mu-sofia.bg
</p>

<p>
rada.staneva@medfac.mu-sofia.bg
</p>
</div>
</div>
