content/MUS-Departments.org
** Pathology
[[https://drive.google.com/drive/folders/1bcgzLt0JJBkrE0LzMgia0GyOHkPuOgzo][Google Drive]]

[[https://www.facebook.com/generalandclinicalpathology][facebook]]

clinpathology@medfac.mu-sofia.bg@medfac.mu-sofia.bg

nterzieva@medfac.mu-sofia.bg

clinpathology@medfac.mu-sofia.bg

djeleva@medfac.mu-sofia.bg
** Medical Microbiology
[[https://drive.google.com/drive/u/1/folders/1BjLM54s5DROi3EqebkT_Ms9mJ9z4bWj3][Google Drive]]

[[https://www.facebook.com/profile.php?id=100048921396729][facebook]]

alexandrova_sa@medfac.mu-sofia.bg

tsitou_vm@medfac.mu-sofia.bg

medmicrobiology@medfac.mu-sofia.bg

dr.strateva@abv.bg

** Pathophysiology
[[https://drive.google.com/drive/folders/1KfDD1cI-0I_LUYhJ_wuGC5BkgJCUNn6G][Google Drive]]

[[https://www.facebook.com/pathophysiology.sofia][facebook]]

pathophysiology@medfac.mu-sofia.bg

romantashev@medfac.mu-sofia.bg

pathophysiology@medfac.mu-sofia.bg

g.maksimov@medfac.mu-sofia.bg
** Department of Pharmacology and Toxicology
[[https://drive.google.com/drive/folders/1URuS4t4gMUC4GAMrrKMvbgkKZXG3aO3a][Google Drive]]

[[https://www.facebook.com/profile.php?id=100049069925760][facebook]]

E-mail: pharmtoxicology@medfac.mu-sofia.bg

tpetrova@medfac.mu-sofia.bg

pharmtoxicology@medfac.mu-sofia.bg - pharmacology.sofia@gmail.com

kkoleva@medfac.mu-sofia.bg
** Propedeutics of Internal Diseases
[[https://drive.google.com/drive/folders/1MSegk-C-zeoRaXXCcW7qG_yAOOThpZMu][Google Drive]]

[[https://www.facebook.com/profile.php?id=100049014907121][facebook]]

E-mail: propedeutics@medfac.mu-sofia.bg

dimitar.syojanov@abv.bg

propedeutics@medfac.mu-sofia.bg

snaydenov@medfac.mu-sofia.bg
* 4th year
** Department Imaging
[[https://www.facebook.com/102065414801883/][facebook]]
nfileva@medfac.mu-sofia.bg
diagnostic.imaging@medfac.mu-sofia.bg
imagediagnostics@medfac.mu-sofia.bg
/Location:  Mostly held in the first floor of Aleksandrovka, where you had the Internal Medicine./
** Nuclear Medicine
novoselski@medfac.mu-sofia.bg
nuconc@medfac.mu-sofia.bg
/Location :  Go one floor below the Chemistry department in Prec. building./
** Otorhinolaryngology
[[https://www.facebook.com/groups/254931819189384][facebook]]
E-mail: otorhin@medfac.mu-sofia.bg\n\
g.popov@medfac.mu-sofia.bg\n\
Location: ISUL
** Department of Hygiene:
[[https://drive.google.com/drive/folders/1CNB3zQn5VwPqXsazYR0oaojQNOuLCfpL][Drive]]
[[https://www.facebook.com/profile.php?id=100048900709387][facebook]]
hyg@medfac.mu-sofia.bg
/Location: Go one floor below the Chemistry department in Prec. building./
** Department of Occupational Diseases
[[https://drive.google.com/drive/folders/1idMleYdVwytRgGMN6EH490lHQJCY1BFt][Drive]]
[[https://www.facebook.com/occdiseases][facebook]]
occdiseases@medfac.mu-sofia.bg
/Location: St. Ivan Rilski hospital, next to Hygiene building where you had your Med.Ethics./
** Department of Ophthalmology
[[https://drive.google.com/drive/folders/1RSJKfbbkJv4g18bapGbMB4-M8YxvbmxN][Drive]]
[[https://www.facebook.com/profile.php?id=100048864553053][facebook]]
E-mail: ophthalmology@medfac.mu-sofia.bg
/Location: SBAL Sv.Ekaterina, 4th floor/
**  Neurology:
jpetrova@medfac.mu-sofia.bg
neurology@medfac.mu-sofia.bg
/Location: Past right from the Sports Centre, go right and turn left. It should be written in Bulgarian./
** Department of General and clinical pathology
[[https://drive.google.com/drive/folders/1bcgzLt0JJBkrE0LzMgia0GyOHkPuOgzo][Drive]]
[[https://www.facebook.com/generalandclinicalpathology][Facebook]]
clinpathology@medfac.mu-sofia.bg@medfac.mu-sofia.bg
/Location: Enter to the Anatomy building from the door that is in front of Ul.Zdrave and go to the first floor./
** Gastroenterology
+ Gastroenterology - УМБАЛ 'Св. Иван Рилски" 3rd floor
[[https://www.facebook.com/gastroenterology.sofia.7][Facebook]]
E-mail: gastroenterology@medfac.mu-sofia.bg
+ Gastroenterology- ИСУЛ
[[https://drive.google.com/drive/folders/11I1NdjMbTh70DzxqpV9-hFrzdp65NrtM][Drive]]
[[https://www.facebook.com/katedragastroenterologia][Facebook]]
E-mail: gastroenterology.isul@medfac.mu-sofia.bg
** Pulmonary diseases
[[https://drive.google.com/drive/u/0/folders/1AypV9CvfHACsGTASserj-K6mDeVyuKA4][Drive]]
[[https://www.facebook.com/nikolay.yanev.58152][facebook]]
puldiseases@medfac.mu-sofia.bg
/Location: SBALBB "Sveta Sofia" 2nd floor./
** General Medicine
[[https://www.facebook.com/General-Medicine-102478428070370/][Facebook]]
generalmedicine@medfac.mu-sofia.bg
/Location: St.Anna University Hospital in Mladost 1 District/
** Surgery
[[https://drive.google.com/drive/folders/1hEZOH_weQHG2xzu9nQh3A2b8K8I3-avp][Drive]]
[[https://www.facebook.com/profile.php?id=100049329214397][Facebook]]
surgery@medfac.mu-sofia.bg
** Cardiology
[[https://www.facebook.com/profile.php?id=100049776151161][Facebook]]
cardiology@medfac.mu-sofia.bg
** Nephrology
[[https://www.facebook.com/maria.hristova.14473426?_rdc=1&_rdr][Facebook]]
nephrology@medfac.mu-sofia.bg
/4th floor of Ivan R./
** Department of Internal Medicine
[[https://drive.google.com/drive/folders/1bWyRz1QKfIOx1qPU5cdGNvRBJjrkPhsu][Drive]]
[[https://www.facebook.com/profile.php?id=100049357509217][Facebook]]
intmedicine@medfac.mu-sofia.bg
* 5th year
** Endocrinology
[[https://drive.google.com/drive/folders/1_scbx_01MYWNKYSeNNih2-2WCWS9qvaD][Drive]]
[[https://www.facebook.com/profile.php?id=100049075613409][Facebook]]
E-mail: endocrinology@medfac.mu-sofia.bg
** Hematology
[[https://drive.google.com/drive/folders/1ymGPOTfHJZhNLyg6pwsAsdVZKgBZWmUy][Drive]]
[[https://www.facebook.com/profile.php?id=100049704814270][Facebook]]
E-mail: hematology@medfac.mu-sofia.bg
