public/MUS-Departments.html
<div id="outline-container-orgf9ee42a" class="outline-3">
<h3 id="orgf9ee42a">Pathology</h3>
<div class="outline-text-3" id="text-orgf9ee42a">
<p>
<a href="https://drive.google.com/drive/folders/1bcgzLt0JJBkrE0LzMgia0GyOHkPuOgzo">Google Drive</a>
</p>

<p>
<a href="https://www.facebook.com/generalandclinicalpathology">facebook</a>
</p>

<p>
clinpathology@medfac.mu-sofia.bg@medfac.mu-sofia.bg
</p>

<p>
nterzieva@medfac.mu-sofia.bg
</p>

<p>
clinpathology@medfac.mu-sofia.bg
</p>

<p>
djeleva@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-org30eb5ae" class="outline-3">
<h3 id="org30eb5ae">Medical Microbiology</h3>
<div class="outline-text-3" id="text-org30eb5ae">
<p>
<a href="https://drive.google.com/drive/u/1/folders/1BjLM54s5DROi3EqebkT_Ms9mJ9z4bWj3">Google Drive</a>
</p>

<p>
<a href="https://www.facebook.com/profile.php?id=100048921396729">facebook</a>
</p>

<p>
alexandrova_sa@medfac.mu-sofia.bg
</p>

<p>
tsitou_vm@medfac.mu-sofia.bg
</p>

<p>
medmicrobiology@medfac.mu-sofia.bg
</p>

<p>
dr.strateva@abv.bg
</p>
</div>
</div>

<div id="outline-container-org0dfc09d" class="outline-3">
<h3 id="org0dfc09d">Pathophysiology</h3>
<div class="outline-text-3" id="text-org0dfc09d">
<p>
<a href="https://drive.google.com/drive/folders/1KfDD1cI-0I_LUYhJ_wuGC5BkgJCUNn6G">Google Drive</a>
</p>

<p>
<a href="https://www.facebook.com/pathophysiology.sofia">facebook</a>
</p>

<p>
pathophysiology@medfac.mu-sofia.bg
</p>

<p>
romantashev@medfac.mu-sofia.bg
</p>

<p>
pathophysiology@medfac.mu-sofia.bg
</p>

<p>
g.maksimov@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-org8d0422f" class="outline-3">
<h3 id="org8d0422f">Department of Pharmacology and Toxicology</h3>
<div class="outline-text-3" id="text-org8d0422f">
<p>
<a href="https://drive.google.com/drive/folders/1URuS4t4gMUC4GAMrrKMvbgkKZXG3aO3a">Google Drive</a>
</p>

<p>
<a href="https://www.facebook.com/profile.php?id=100049069925760">facebook</a>
</p>

<p>
E-mail: pharmtoxicology@medfac.mu-sofia.bg
</p>

<p>
tpetrova@medfac.mu-sofia.bg
</p>

<p>
pharmtoxicology@medfac.mu-sofia.bg - pharmacology.sofia@gmail.com
</p>

<p>
kkoleva@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-org2d10038" class="outline-3">
<h3 id="org2d10038">Propedeutics of Internal Diseases</h3>
<div class="outline-text-3" id="text-org2d10038">
<p>
<a href="https://drive.google.com/drive/folders/1MSegk-C-zeoRaXXCcW7qG_yAOOThpZMu">Google Drive</a>
</p>

<p>
<a href="https://www.facebook.com/profile.php?id=100049014907121">facebook</a>
</p>

<p>
E-mail: propedeutics@medfac.mu-sofia.bg
</p>

<p>
dimitar.syojanov@abv.bg
</p>

<p>
propedeutics@medfac.mu-sofia.bg
</p>

<p>
snaydenov@medfac.mu-sofia.bg
</p>
</div>
</div>
</div>
<div id="outline-container-org4d81fd5" class="outline-2">
<h2 id="org4d81fd5">4th year</h2>
<div class="outline-text-2" id="text-org4d81fd5">
</div>
<div id="outline-container-org0697599" class="outline-3">
<h3 id="org0697599">Department Imaging</h3>
<div class="outline-text-3" id="text-org0697599">
<p>
<a href="https://www.facebook.com/102065414801883/">facebook</a>
nfileva@medfac.mu-sofia.bg
diagnostic.imaging@medfac.mu-sofia.bg
imagediagnostics@medfac.mu-sofia.bg
<i>Location:  Mostly held in the first floor of Aleksandrovka, where you had the Internal Medicine.</i>
</p>
</div>
</div>
<div id="outline-container-orga5681d9" class="outline-3">
<h3 id="orga5681d9">Nuclear Medicine</h3>
<div class="outline-text-3" id="text-orga5681d9">
<p>
novoselski@medfac.mu-sofia.bg
nuconc@medfac.mu-sofia.bg
<i>Location :  Go one floor below the Chemistry department in Prec. building.</i>
</p>
</div>
</div>
<div id="outline-container-org1213a39" class="outline-3">
<h3 id="org1213a39">Otorhinolaryngology</h3>
<div class="outline-text-3" id="text-org1213a39">
<p>
<a href="https://www.facebook.com/groups/254931819189384">facebook</a>
E-mail: otorhin@medfac.mu-sofia.bg\n\
g.popov@medfac.mu-sofia.bg\n\
Location: ISUL
</p>
</div>
</div>
<div id="outline-container-org444d4db" class="outline-3">
<h3 id="org444d4db">Department of Hygiene:</h3>
<div class="outline-text-3" id="text-org444d4db">
<p>
<a href="https://drive.google.com/drive/folders/1CNB3zQn5VwPqXsazYR0oaojQNOuLCfpL">Drive</a>
<a href="https://www.facebook.com/profile.php?id=100048900709387">facebook</a>
hyg@medfac.mu-sofia.bg
<i>Location: Go one floor below the Chemistry department in Prec. building.</i>
</p>
</div>
</div>
<div id="outline-container-org4315ee4" class="outline-3">
<h3 id="org4315ee4">Department of Occupational Diseases</h3>
<div class="outline-text-3" id="text-org4315ee4">
<p>
<a href="https://drive.google.com/drive/folders/1idMleYdVwytRgGMN6EH490lHQJCY1BFt">Drive</a>
<a href="https://www.facebook.com/occdiseases">facebook</a>
occdiseases@medfac.mu-sofia.bg
<i>Location: St. Ivan Rilski hospital, next to Hygiene building where you had your Med.Ethics.</i>
</p>
</div>
</div>
<div id="outline-container-orgdaa370b" class="outline-3">
<h3 id="orgdaa370b">Department of Ophthalmology</h3>
<div class="outline-text-3" id="text-orgdaa370b">
<p>
<a href="https://drive.google.com/drive/folders/1RSJKfbbkJv4g18bapGbMB4-M8YxvbmxN">Drive</a>
<a href="https://www.facebook.com/profile.php?id=100048864553053">facebook</a>
E-mail: ophthalmology@medfac.mu-sofia.bg
<i>Location: SBAL Sv.Ekaterina, 4th floor</i>
</p>
</div>
</div>
<div id="outline-container-org98f431c" class="outline-3">
<h3 id="org98f431c">Neurology:</h3>
<div class="outline-text-3" id="text-org98f431c">
<p>
jpetrova@medfac.mu-sofia.bg
neurology@medfac.mu-sofia.bg
<i>Location: Past right from the Sports Centre, go right and turn left. It should be written in Bulgarian.</i>
</p>
</div>
</div>
<div id="outline-container-org734339a" class="outline-3">
<h3 id="org734339a">Department of General and clinical pathology</h3>
<div class="outline-text-3" id="text-org734339a">
<p>
<a href="https://drive.google.com/drive/folders/1bcgzLt0JJBkrE0LzMgia0GyOHkPuOgzo">Drive</a>
<a href="https://www.facebook.com/generalandclinicalpathology">Facebook</a>
clinpathology@medfac.mu-sofia.bg@medfac.mu-sofia.bg
<i>Location: Enter to the Anatomy building from the door that is in front of Ul.Zdrave and go to the first floor.</i>
</p>
</div>
</div>
<div id="outline-container-org854bb9e" class="outline-3">
<h3 id="org854bb9e">Gastroenterology</h3>
<div class="outline-text-3" id="text-org854bb9e">
<ul class="org-ul">
<li>Gastroenterology - УМБАЛ 'Св. Иван Рилски" 3rd floor</li>
</ul>
<p>
<a href="https://www.facebook.com/gastroenterology.sofia.7">Facebook</a>
E-mail: gastroenterology@medfac.mu-sofia.bg
</p>
<ul class="org-ul">
<li>Gastroenterology- ИСУЛ</li>
</ul>
<p>
<a href="https://drive.google.com/drive/folders/11I1NdjMbTh70DzxqpV9-hFrzdp65NrtM">Drive</a>
<a href="https://www.facebook.com/katedragastroenterologia">Facebook</a>
E-mail: gastroenterology.isul@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-orgb274cbb" class="outline-3">
<h3 id="orgb274cbb">Pulmonary diseases</h3>
<div class="outline-text-3" id="text-orgb274cbb">
<p>
<a href="https://drive.google.com/drive/u/0/folders/1AypV9CvfHACsGTASserj-K6mDeVyuKA4">Drive</a>
<a href="https://www.facebook.com/nikolay.yanev.58152">facebook</a>
puldiseases@medfac.mu-sofia.bg
<i>Location: SBALBB "Sveta Sofia" 2nd floor.</i>
</p>
</div>
</div>
<div id="outline-container-org3949f79" class="outline-3">
<h3 id="org3949f79">General Medicine</h3>
<div class="outline-text-3" id="text-org3949f79">
<p>
<a href="https://www.facebook.com/General-Medicine-102478428070370/">Facebook</a>
generalmedicine@medfac.mu-sofia.bg
<i>Location: St.Anna University Hospital in Mladost 1 District</i>
</p>
</div>
</div>
<div id="outline-container-org1eb328d" class="outline-3">
<h3 id="org1eb328d">Surgery</h3>
<div class="outline-text-3" id="text-org1eb328d">
<p>
<a href="https://drive.google.com/drive/folders/1hEZOH_weQHG2xzu9nQh3A2b8K8I3-avp">Drive</a>
<a href="https://www.facebook.com/profile.php?id=100049329214397">Facebook</a>
surgery@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-org9b14177" class="outline-3">
<h3 id="org9b14177">Cardiology</h3>
<div class="outline-text-3" id="text-org9b14177">
<p>
<a href="https://www.facebook.com/profile.php?id=100049776151161">Facebook</a>
cardiology@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-orgfe87eef" class="outline-3">
<h3 id="orgfe87eef">Nephrology</h3>
<div class="outline-text-3" id="text-orgfe87eef">
<p>
<a href="https://www.facebook.com/maria.hristova.14473426?_rdc=1&amp;_rdr">Facebook</a>
nephrology@medfac.mu-sofia.bg
<i>4th floor of Ivan R.</i>
</p>
</div>
</div>
<div id="outline-container-orgec54328" class="outline-3">
<h3 id="orgec54328">Department of Internal Medicine</h3>
<div class="outline-text-3" id="text-orgec54328">
<p>
<a href="https://drive.google.com/drive/folders/1bWyRz1QKfIOx1qPU5cdGNvRBJjrkPhsu">Drive</a>
<a href="https://www.facebook.com/profile.php?id=100049357509217">Facebook</a>
intmedicine@medfac.mu-sofia.bg
</p>
</div>
</div>
</div>
<div id="outline-container-orgb5bcc44" class="outline-2">
<h2 id="orgb5bcc44">5th year</h2>
<div class="outline-text-2" id="text-orgb5bcc44">
</div>
<div id="outline-container-orgba7bfcc" class="outline-3">
<h3 id="orgba7bfcc">Endocrinology</h3>
<div class="outline-text-3" id="text-orgba7bfcc">
<p>
<a href="https://drive.google.com/drive/folders/1_scbx_01MYWNKYSeNNih2-2WCWS9qvaD">Drive</a>
<a href="https://www.facebook.com/profile.php?id=100049075613409">Facebook</a>
E-mail: endocrinology@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-orga7b8f3e" class="outline-3">
<h3 id="orga7b8f3e">Hematology</h3>
<div class="outline-text-3" id="text-orga7b8f3e">
<p>
<a href="https://drive.google.com/drive/folders/1ymGPOTfHJZhNLyg6pwsAsdVZKgBZWmUy">Drive</a>
<a href="https://www.facebook.com/profile.php?id=100049704814270">Facebook</a>
E-mail: hematology@medfac.mu-sofia.bg
</p>
</div>
</div>
