content/MUS-Departments.org
** Rheumatology
[[https://drive.google.com/drive/folders/1z8Yc32FFQLV2vmBRcqOy4p3lJr7u8lcD][Drive]]
[[https://www.facebook.com/profile.php?id=100051083618034][Facebook]]
E-mail: rheumatology@medfac.mu-sofia.bg
** Allergiology
[[https://drive.google.com/drive/folders/1VLWwN3_qSsKL0oYqeB0mNnD9v663pIOe][Drive]]
[[https://www.facebook.com/profile.php?id=100049698875558][Facebook]]
E-mail: allergology@medfac.mu-sofia.bg
** Department of Clinical Laboratory
[[https://drive.google.com/drive/folders/1wqJR8rVeRXIXHZ7XyTaAFktIcRd01XN0][Drive]]
[[https://www.facebook.com/profile.php?id=100049076106311][Facebook]]
E-mail: clinlaboratory@medfac.mu-sofia.bgg
** Clinical Immunology
[[https://drive.google.com/drive/folders/1D-rcIIzvSnsC3amJH-Fn0RJjmi6UXIUc][Drive]] | Year 3
[[https://drive.google.com/drive/folders/18TKdhBABWhL9eaXjkOEMO67FeYcWAZCN][Drive]] | Year 5
[[https://www.facebook.com/profile.php?id=100048911691308][Facebook]]
E-mail: clinicalimmunology@medfac.mu-sofia.bg
** Clinical Pharmacology
[[https://drive.google.com/drive/folders/1AvApLrPEG7PFwgdyxf80UpBSJXTnhlZT][Drive]]
E-mail: clinpharmacology@medfac.mu-sofia.bg
** Obstetrics Gynecology
[[https://www.facebook.com/obstetrics.gynecology.370][Facebook]]
obsgynecology@medfac.mu-sofia.bg
sergeislavov@medfac.mu-sofia.bg
** Pediatrics
[[https://drive.google.com/drive/folders/1LonIURWrY-Q_o4FPMwDb-pF3Qd98ziNc][Drive]]
[[https://www.facebook.com/profile.php?id=100049085408042][Facebook]]
E-mail: pediatrics@medfac.mu-sofia.bg
** Neurosurgery:
d.popov@medfac.mu-sofia.bg
** Clinic Toxicology
[[https://www.facebook.com/clinictoxicology.pirogov.5][Facebook]]
E-mail: toxicology@medfac.mu-sofia.bg
** Dermatology and Venereology
[[https://www.facebook.com/dermatology.venereology.18][Facebook]]
E-mail: dermnvenerology@medfac.mu-sofia.bg
/Location: Han Presiian, 1431 , Sofia/
** Orthopedics and Traumatology
[[https://drive.google.com/drive/folders/1xpdUpnSp_mvgK1kQAR36_GsiPLu3jJZ8 ][Drive]]
* 6th year
** Anesthesiology
[[https://www.facebook.com/profile.php?id=100049064921644][Facebook]]
anesthesiology@medfac.mu-sofia.bg
** Psychiatry
[[https://drive.google.com/drive/folders/1TeuQMJUHd3I9_1mGm8R8mGGM59bj2btH][Drive]]
[[https://www.facebook.com/profile.php?id=100048705774249][Facebook]]
E-mail: psychiatry@medfac.mu-sofia.bg
** Urology
[[https://drive.google.com/drive/folders/1HcGhEJb3TZxpfEdfrY-BBhLKVLZ8KLb6][Drive]]
[[https://www.facebook.com/groups/1290050027861050][Facebook]]
E-mail: urology@medfac.mu-sofia.bg
** Physiotherapy
aaleksiev@medfac.mu-sofia.bg
** Department of Epidemiology
[[https://drive.google.com/drive/folders/1NY8zQF7770BxILS1DUMt5l2c1m_-3J1y][Drive]]
[[https://www.facebook.com/epidemology][Facebook]]
/E-mail: epidemology@medfac.mu-sofia.bg/
** Cardiovascular Surgery and Invasive Cardiology
[[https://drive.google.com/drive/folders/1l8iZbBKfTv7WkF3zo79t3fm0C4HZr32r][Drive]]
[[https://www.facebook.com/100049486160029][Facebook]]
E-mail: cardiovascular@medfac.mu-sofia.bg
** 0ccupational diseases:
j.doncheva-dilova@medfac.mu-sofia.bg
** Hygiene
mnikolova@medfac.mu-sofia.bg
** Obstetrics Gynecology
[[https://www.facebook.com/obstetrics.gynecology.370][Facebook]]
obsgynecology@medfac.mu-sofia.bg
** Forensic Medicine
[[https://www.facebook.com/foren.medi.5][Facebook]]
E-mail: forensic@medfac.mu-sofia.bg
/Location: bul. "Pencho Slaveykov" 43 , 1463 , Sofia/
