public/MUS-Departments.html
<div id="outline-container-org63ff951" class="outline-3">
<h3 id="org63ff951">Rheumatology</h3>
<div class="outline-text-3" id="text-org63ff951">
<p>
<a href="https://drive.google.com/drive/folders/1z8Yc32FFQLV2vmBRcqOy4p3lJr7u8lcD">Drive</a>
<a href="https://www.facebook.com/profile.php?id=100051083618034">Facebook</a>
E-mail: rheumatology@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-org749317a" class="outline-3">
<h3 id="org749317a">Allergiology</h3>
<div class="outline-text-3" id="text-org749317a">
<p>
<a href="https://drive.google.com/drive/folders/1VLWwN3_qSsKL0oYqeB0mNnD9v663pIOe">Drive</a>
<a href="https://www.facebook.com/profile.php?id=100049698875558">Facebook</a>
E-mail: allergology@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-orge8cc7b3" class="outline-3">
<h3 id="orge8cc7b3">Department of Clinical Laboratory</h3>
<div class="outline-text-3" id="text-orge8cc7b3">
<p>
<a href="https://drive.google.com/drive/folders/1wqJR8rVeRXIXHZ7XyTaAFktIcRd01XN0">Drive</a>
<a href="https://www.facebook.com/profile.php?id=100049076106311">Facebook</a>
E-mail: clinlaboratory@medfac.mu-sofia.bgg
</p>
</div>
</div>
<div id="outline-container-orga86a99d" class="outline-3">
<h3 id="orga86a99d">Clinical Immunology</h3>
<div class="outline-text-3" id="text-orga86a99d">
<p>
<a href="https://drive.google.com/drive/folders/1D-rcIIzvSnsC3amJH-Fn0RJjmi6UXIUc">Drive</a> | Year 3
<a href="https://drive.google.com/drive/folders/18TKdhBABWhL9eaXjkOEMO67FeYcWAZCN">Drive</a> | Year 5
<a href="https://www.facebook.com/profile.php?id=100048911691308">Facebook</a>
E-mail: clinicalimmunology@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-orgcde4b08" class="outline-3">
<h3 id="orgcde4b08">Clinical Pharmacology</h3>
<div class="outline-text-3" id="text-orgcde4b08">
<p>
<a href="https://drive.google.com/drive/folders/1AvApLrPEG7PFwgdyxf80UpBSJXTnhlZT">Drive</a>
E-mail: clinpharmacology@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-org442ce3d" class="outline-3">
<h3 id="org442ce3d">Obstetrics Gynecology</h3>
<div class="outline-text-3" id="text-org442ce3d">
<p>
<a href="https://www.facebook.com/obstetrics.gynecology.370">Facebook</a>
obsgynecology@medfac.mu-sofia.bg
sergeislavov@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-orgd3d70e8" class="outline-3">
<h3 id="orgd3d70e8">Pediatrics</h3>
<div class="outline-text-3" id="text-orgd3d70e8">
<p>
<a href="https://drive.google.com/drive/folders/1LonIURWrY-Q_o4FPMwDb-pF3Qd98ziNc">Drive</a>
<a href="https://www.facebook.com/profile.php?id=100049085408042">Facebook</a>
E-mail: pediatrics@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-org026d65c" class="outline-3">
<h3 id="org026d65c">Neurosurgery:</h3>
<div class="outline-text-3" id="text-org026d65c">
<p>
d.popov@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-orgb855597" class="outline-3">
<h3 id="orgb855597">Clinic Toxicology</h3>
<div class="outline-text-3" id="text-orgb855597">
<p>
<a href="https://www.facebook.com/clinictoxicology.pirogov.5">Facebook</a>
E-mail: toxicology@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-org4740224" class="outline-3">
<h3 id="org4740224">Dermatology and Venereology</h3>
<div class="outline-text-3" id="text-org4740224">
<p>
<a href="https://www.facebook.com/dermatology.venereology.18">Facebook</a>
E-mail: dermnvenerology@medfac.mu-sofia.bg
<i>Location: Han Presiian, 1431 , Sofia</i>
</p>
</div>
</div>
<div id="outline-container-orga2cb306" class="outline-3">
<h3 id="orga2cb306">Orthopedics and Traumatology</h3>
<div class="outline-text-3" id="text-orga2cb306">
<p>
<a href="https://drive.google.com/drive/folders/1xpdUpnSp_mvgK1kQAR36_GsiPLu3jJZ8%20">Drive</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgfd3bb19" class="outline-2">
<h2 id="orgfd3bb19">6th year</h2>
<div class="outline-text-2" id="text-orgfd3bb19">
</div>
<div id="outline-container-orge711fe9" class="outline-3">
<h3 id="orge711fe9">Anesthesiology</h3>
<div class="outline-text-3" id="text-orge711fe9">
<p>
<a href="https://www.facebook.com/profile.php?id=100049064921644">Facebook</a>
anesthesiology@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-orgcf1c6a4" class="outline-3">
<h3 id="orgcf1c6a4">Psychiatry</h3>
<div class="outline-text-3" id="text-orgcf1c6a4">
<p>
<a href="https://drive.google.com/drive/folders/1TeuQMJUHd3I9_1mGm8R8mGGM59bj2btH">Drive</a>
<a href="https://www.facebook.com/profile.php?id=100048705774249">Facebook</a>
E-mail: psychiatry@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-org831c1f5" class="outline-3">
<h3 id="org831c1f5">Urology</h3>
<div class="outline-text-3" id="text-org831c1f5">
<p>
<a href="https://drive.google.com/drive/folders/1HcGhEJb3TZxpfEdfrY-BBhLKVLZ8KLb6">Drive</a>
<a href="https://www.facebook.com/groups/1290050027861050">Facebook</a>
E-mail: urology@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-org21fa54a" class="outline-3">
<h3 id="org21fa54a">Physiotherapy</h3>
<div class="outline-text-3" id="text-org21fa54a">
<p>
aaleksiev@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-orgc6be2de" class="outline-3">
<h3 id="orgc6be2de">Department of Epidemiology</h3>
<div class="outline-text-3" id="text-orgc6be2de">
<p>
<a href="https://drive.google.com/drive/folders/1NY8zQF7770BxILS1DUMt5l2c1m_-3J1y">Drive</a>
<a href="https://www.facebook.com/epidemology">Facebook</a>
<i>E-mail: epidemology@medfac.mu-sofia.bg</i>
</p>
</div>
</div>
<div id="outline-container-org8ec5966" class="outline-3">
<h3 id="org8ec5966">Cardiovascular Surgery and Invasive Cardiology</h3>
<div class="outline-text-3" id="text-org8ec5966">
<p>
<a href="https://drive.google.com/drive/folders/1l8iZbBKfTv7WkF3zo79t3fm0C4HZr32r">Drive</a>
<a href="https://www.facebook.com/100049486160029">Facebook</a>
E-mail: cardiovascular@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-org61edf67" class="outline-3">
<h3 id="org61edf67">0ccupational diseases:</h3>
<div class="outline-text-3" id="text-org61edf67">
<p>
j.doncheva-dilova@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-org8d52fd9" class="outline-3">
<h3 id="org8d52fd9">Hygiene</h3>
<div class="outline-text-3" id="text-org8d52fd9">
<p>
mnikolova@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-orgc1cec36" class="outline-3">
<h3 id="orgc1cec36">Obstetrics Gynecology</h3>
<div class="outline-text-3" id="text-orgc1cec36">
<p>
<a href="https://www.facebook.com/obstetrics.gynecology.370">Facebook</a>
obsgynecology@medfac.mu-sofia.bg
</p>
</div>
</div>
<div id="outline-container-orgdf5babb" class="outline-3">
<h3 id="orgdf5babb">Forensic Medicine</h3>
<div class="outline-text-3" id="text-orgdf5babb">
<p>
<a href="https://www.facebook.com/foren.medi.5">Facebook</a>
E-mail: forensic@medfac.mu-sofia.bg
<i>Location: bul. "Pencho Slaveykov" 43 , 1463 , Sofia</i>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Thanos Apollo</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
